{
 "name":"Олег", /*Есть строка*/
  "age": 60,     /*Есть число*/
  "isOnLine": true, /*Есть булевое значение*/
  "phone": null /*Есть null, когда ничего не задано*/
  "email": "email@com"
}
/* А чтобы данные о нашем Human были переданы в таком красивом формате, есть специальные
библиотеки, которые преобразовывают объект в JSON формат. Эти библиотеки мы ищем
в интернете на сайте "Maven repo". Этот сайт по сути как гугл плэй, только там скачиваем
не приложения, а библиотеки (https://mvnrepository.com/). Которая будет решать какую нибудь
нашу проблему. Например, преобразовать наш объект Human в JSON файл. Просто в поисковик
сайта введем JSON и он нам покажет возможные варианты. На уроке рассмотрим библиотеку
jackson Databind. Выбираем версию, например ту которая наибольшее количество раз
использовалась 2.17.2. Копируем ссылочку внизу в окошке. Далее переходим в IDEA, находим
файл

????????????????????????????????



Идём далее. У нас есть файл pom.xml. В этом файле между последней и предпоследней строчкой </properties> и </project>
пишем <dependencies></dependencies> и между ними, где у меня стоят точки вставляем скопированный ранее код

</properties>
<dependencies>

............

</dependencies>
</project>

Должно получиться примерно вот так:

    </properties>

    <dependencies>

        <dependency>
            <groupId>com.fasterxml.jackson.core</groupId>
            <artifactId>jackson-databind</artifactId>
            <version>2.17.2</version>
        </dependency>

    </dependencies>

</project>

Как результат, в правом верхнем углу появиться кнопочка "Load Maven Changes", её обязательно нужно будет
 нажать. Или если она не появилась, то нажать Ctrl + Shift + O. ЭТО ВАЖНО НАЖАТЬ, ЧТОБЫ ПОДТЯНУЛАСЬ ЭТА ЗАВИСИМОСТЬ
 и теперь мы можем пользоваться этой библиотекой. Так же как мы пользовались например классом Files или классом
 Integer в созданном мной классе CounterTask. Точно также будем использовать и класс jackson. Далее создадим новый
 класс HumanToJsonFile





*/