//4. Задание про циклы
//        ● напечатайте на экран числа от 1 до 1 000 000 000


package Домашка3;

public class Task4 {

    public static void main(String[] args) {


        for (int i = 1; i <= 1_000_000_000; i++) {
            System.out.println("Число" + " " + i);

        }


    }
}

