package Лекция101211.JSON;

public class Site {

    public static void main(String[] args) {

       // Работа с JSON (JavaScript Object Notation)

       // Представим, что мы пишем свой собственный сайт. Соц. сеть Human. Бэкэнд пишем на JAVA, фронтэнд
        // на JAVA Script. На фронт к нам приходят данные о нашем человеке (имя, возраст и т.д.) с
       // бэка. Как было сказано выше и фронт и бэк написаны на разных языках. Вопрос возникает,
        // как передать данные с бэка на фронт, как научиться общаться двум языкам? А для этого есть
        // несколько способов, а самый распространённый формат описания данных JSON.
        // Для этого создадим отдельный файл Human.JSON и будем работать там



    }
}
